---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadPowerParam
source: html/79e6f8f6-009a-ea78-58cf-07ee28769a72.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelTotalestloadPowerParam Property

"Power Total Estimated Demand"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelTotalestloadPowerParam { get; }
```